In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(
{'key' : ['b', 'b', 'a', 'c' ,'a', 'a', 'b'], 'data1': range(7)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [3]:
df2 = pd.DataFrame(
{'key': ['a', 'b', 'd'], 'data2': range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [5]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [6]:
pd.merge(df1, df2, how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [7]:
pd.merge(df1, df2, how='inner')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [8]:
pd.merge(df1, df2, how='left')

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [9]:
pd.merge(df1, df2, how='right')

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

In [10]:
df1 = pd.DataFrame(
{'key1': ['foo', 'foo', 'bar'], 
'key2' : ['one', 'two', 'one'],
'lval' : [1, 2, 3]})
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [11]:
df2 = pd.DataFrame({
        'key1' : ['foo', 'foo', 'bar', 'bar'],
        'key2' : ['one', 'one', 'one', 'two'],
        'rval' : [4, 5, 6, 7]
    })
df2

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [12]:
pd.merge(df1, df2, how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [14]:
 pd.merge(df1, df2, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [16]:
pd.merge(df1, df2, on=['key1'], how='outer')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [17]:
pd.merge(df1, df2, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [18]:
df1 = pd.DataFrame({
        'key1' : ['foo', 'foo', 'bar'],
        'key2' : ['one', 'two', 'one'],
        'lval' : [1, 2, 3]
    })

In [19]:
df2 = pd.DataFrame({
        'k1' : ['foo' ,'foo', 'bar' ,'bar'],
        'k2' : ['one', 'one', 'one', 'two'],
        'rval' : [4, 5, 6, 7]
    })

In [21]:
pd.merge(df1, df2, left_on='key1', right_on='k1')

  key1 key2  lval   k1   k2  rval
0  foo  one     1  foo  one     4
1  foo  one     1  foo  one     5
2  foo  two     2  foo  one     4
3  foo  two     2  foo  one     5
4  bar  one     3  bar  one     6
5  bar  one     3  bar  two     7

In [22]:
df1 = pd.DataFrame({
        'key' : ['a', 'b', 'a', 'a', 'b', 'c'],
        'value' : range(6)
    })
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [27]:
df2 = pd.DataFrame({
        'group_val' : [3.5, 7]},
        index = ['a', 'b']
    )
df2

   group_val
a        3.5
b        7.0

In [28]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [29]:
df1 = pd.DataFrame({
        'data' : np.arange(5.),
        'key1' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'key2' : [2000, 2001, 2002, 2001, 2002]
    })
df1

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [30]:
df2 = pd.DataFrame(np.arange(12).reshape((6,2)),
                  index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                  [2001, 2000, 2000, 2000, 2001, 2002]],
                  columns=['event1', 'event2'])
df2

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [33]:
pd.merge(df1, df2, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

In [35]:
df1 = pd.DataFrame(np.arange(1., 7.).reshape((3,2)),
                  index = ['a', 'b', 'c'],
                  columns = ['Ohio', 'Nevada'])
df1

   Ohio  Nevada
a   1.0     2.0
b   3.0     4.0
c   5.0     6.0

In [36]:
df2 = pd.DataFrame(np.arange(7., 15.).reshape(4, 2),
                  index=['b', 'c', 'd', 'e'],
                  columns=['Missouri', 'Alabama'])
df2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [38]:
pd.merge(df1, df2, left_index=True, right_index=True, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   5.0     6.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   NaN     NaN      13.0     14.0

In [42]:
df1.join(df2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   5.0     6.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   NaN     NaN      13.0     14.0

In [44]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index = ['c', 'd', 'e'])
s3 = pd.Series([5, 6], index = ['f', 'g'])

In [46]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [47]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [48]:
df1 = pd.DataFrame(np.arange(12).reshape(6,2),
                  index= [1, 2, 3, 4, 5, 6],
                  columns= ['mae', 'bi'])
df1

   mae  bi
1    0   1
2    2   3
3    4   5
4    6   7
5    8   9
6   10  11

In [49]:
df2 = pd.DataFrame(np.arange(12).reshape(6,2),
                  index= [7, 8, 9, 10, 11, 12],
                  columns= ['mae', 'bi'])
df2

    mae  bi
7     0   1
8     2   3
9     4   5
10    6   7
11    8   9
12   10  11

In [50]:
df1['plus'] = df1['mae'] - df1['bi']

In [51]:
df1

   mae  bi  plus
1    0   1    -1
2    2   3    -1
3    4   5    -1
4    6   7    -1
5    8   9    -1
6   10  11    -1

In [52]:
df2['plus'] = df2['mae'] - df2['bi']
df2

    mae  bi  plus
7     0   1    -1
8     2   3    -1
9     4   5    -1
10    6   7    -1
11    8   9    -1
12   10  11    -1

In [54]:
df3 = pd.concat([df1, df2])
df3

    mae  bi  plus
1     0   1    -1
2     2   3    -1
3     4   5    -1
4     6   7    -1
5     8   9    -1
6    10  11    -1
7     0   1    -1
8     2   3    -1
9     4   5    -1
10    6   7    -1
11    8   9    -1
12   10  11    -1

In [59]:
df4 = pd.DataFrame([[np.sum(df3['mae']), np.sum(df3['bi']), np.sum(df3['plus'])]], 
                  index=['result'], columns=['mae', 'bi', 'plus'])
df4

        mae  bi  plus
result   60  72   -12

In [62]:
pd.concat([df3, df4])

        mae  bi  plus
1         0   1    -1
2         2   3    -1
3         4   5    -1
4         6   7    -1
5         8   9    -1
6        10  11    -1
7         0   1    -1
8         2   3    -1
9         4   5    -1
10        6   7    -1
11        8   9    -1
12       10  11    -1
result   60  72   -12